Revit 2024 API
BuiltInFailures.RebarSystemFailures.CannotPlacePathReinforcementWarn Property
 Can't find a host for Path Reinforcement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotPlacePathReinforcementWarn { get; }
Visual Basic
Public Shared ReadOnly Property CannotPlacePathReinforcementWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotPlacePathReinforcementWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace